In [2]:
import numpy as np
import pandas as pd
from pandas import Series,DataFrame

In [6]:
import webbrowser

In [8]:
link = 'https://www.tiobe.com/tiobe-index/'
webbrowser.open(link)

True

In [11]:
df = pd.read_clipboard()
df

,Jul,2022,Jul.1,2021,Change,Programming,Language,Ratings,Change.1
0,1,3,change,Python,page,Python,13.44%,+2.48%,None
1,2,1,change,C,page,C,13.13%,+1.50%,None
2,3,2,change,Java,page,Java,11.59%,+0.40%,None
3,4,4,C++,page,C++,10.00%,+1.98%,None,None
4,5,5,C#,page,C#,5.65%,+0.82%,None,None
5,6,6,Visual,Basic,page,Visual,Basic,4.97%,+0.47%
6,7,7,JavaScript,page,JavaScript,1.78%,-0.93%,None,None

In [13]:
df.iloc[2:3,:] #index 2:3

   Jul  2022   Jul.1  2021 Change Programming Language Ratings Change.1
2    3     2  change  Java   page        Java   11.59%  +0.40%     None

In [16]:
df.loc[[1,2],:'Change'] #label

   Jul  2022   Jul.1  2021 Change
1    2     1  change     C   page
2    3     2  change  Java   page

In [20]:
s1 = Series([1,2,3,4], index=['A','B','C','D'])
s1

A    1
B    2
C    3
D    4
dtype: int64

In [23]:
s1.reindex(index=['A','B','C','D','E'],fill_value=10)

A     1
B     2
C     3
D     4
E    10
dtype: int64

In [27]:
s2 = Series(['A','B','C'], index=[1,5,10])
s2

1     A
5     B
10    C
dtype: object

In [30]:
s2.reindex(index=range(15),method='ffill') #forward fill

0     NaN
1       A
2       A
3       A
4       A
5       B
6       B
7       B
8       B
9       B
10      C
11      C
12      C
13      C
14      C
dtype: object

In [36]:
df1 =DataFrame(np.random.rand(25).reshape([5,5]),index=['A','B','D','E','F'],columns=['c1','c2','c3','c4','c5'])
df1

         c1        c2        c3        c4        c5
A  0.498516  0.997097  0.183938  0.912366  0.380755
B  0.216632  0.152285  0.290315  0.193934  0.715210
D  0.778609  0.241683  0.136080  0.412865  0.454588
E  0.612548  0.892316  0.101095  0.317563  0.232274
F  0.438121  0.044679  0.649495  0.328531  0.336550

In [40]:
df1.reindex(index=['A','B','C','D','E','F'],columns=['c1','c2','c3','c4','c5','c6'])

         c1        c2        c3        c4        c5  c6
A  0.498516  0.997097  0.183938  0.912366  0.380755 NaN
B  0.216632  0.152285  0.290315  0.193934  0.715210 NaN
C       NaN       NaN       NaN       NaN       NaN NaN
D  0.778609  0.241683  0.136080  0.412865  0.454588 NaN
E  0.612548  0.892316  0.101095  0.317563  0.232274 NaN
F  0.438121  0.044679  0.649495  0.328531  0.336550 NaN

In [43]:
df1.reindex(index=['A'])

         c1        c2        c3        c4        c5
A  0.498516  0.997097  0.183938  0.912366  0.380755

In [45]:
df1.drop('A',axis=0)

         c1        c2        c3        c4        c5
B  0.216632  0.152285  0.290315  0.193934  0.715210
D  0.778609  0.241683  0.136080  0.412865  0.454588
E  0.612548  0.892316  0.101095  0.317563  0.232274
F  0.438121  0.044679  0.649495  0.328531  0.336550

In [47]:
#NaN not a number

In [51]:
n =np.nan
n

nan

In [53]:
type(n)

float

In [55]:
n +1

nan

In [59]:
s1 =Series([1,2,np.nan,4])
s1

0    1.0
1    2.0
2    NaN
3    4.0
dtype: float64

In [61]:
s1.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [63]:
s1.dropna()

0    1.0
1    2.0
3    4.0
dtype: float64

In [66]:
data = {
    'Country': ['China', 'India', 'Brazil'],
    'Capital': ['Beijing', 'New Delhi', 'Brasilia'],
    'Population': ['1432732201', '1303171635', '207847528']
}

In [73]:
df= DataFrame(data)
df.iloc[2,1]= np.nan
df

  Country    Capital  Population
0   China    Beijing  1432732201
1   India  New Delhi  1303171635
2  Brazil        NaN   207847528

In [78]:
df1=df.dropna(axis=0,how ='all')
#thresh nan多于几个才删除
df1

  Country    Capital  Population
0   China    Beijing  1432732201
1   India  New Delhi  1303171635
2  Brazil        NaN   207847528